y_connector/y_15ml-per-minute_4cm_refined/system/meshQualityDict
// included in snappyHexMeshDict

// Documentation of the following variables: https://www.openfoam.com/documentation/guides/latest/doc/guide-meshing-snappyhexmesh-meshquality.html

// "Maximum face non-orthogonality angle [deg]: the angle made by the vector between the two adjacent cell centres across the common face and the face normal"
maxNonOrtho 65;

maxBoundarySkewness 20;

// "Maximum internal face skewness"
maxInternalSkewness 4;

// "Maximum cell concavity [deg]"
maxConcave 80;

// "Minimum cell pyramid volume [m³]"
minVol 1e-13;

// "Minimum tetrahedron quality"
//  1e-15 (small positive) to enable tracking
// -1e+30 (large negative) for best layer insertion
minTetQuality 1e-15;

// "if >0 : preserve single cells with all points on the surface if the
// resulting volume after snapping (by approximation) is larger than
// minVolCollapseRatio times old volume (i.e. not collapsed to flat cell).
//  If <0 : delete always."
//minVolCollapseRatio 0.5; // commented out in documentation…

// "Minimum face area [m 2]: A negative value to bypass this metric"
minArea -1;

minTwist 0.02;

// "Minimum cell determinant"
minDeterminant 0.001;

// "Minimum face interpolation weight"
minFaceWeight 0.05;

// "Optional"
minFaceFlatness -1;

minVolRatio 0.01;

minTriangleTwist -1;

// nSmoothScale and errorReduction defined in snappyHexMeshDict!
